---
type: Control
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# Control

`Autodesk.Revit.DB.Control` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Origin | — | `public XYZ Origin { get ; }` |
| Property | Parameter | — | `` |
| Property | Shape | — | `public ControlShape Shape { get ; }` |
| Property | View | — | `public View View { get ; }` |